Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CombinedDimensionAttributes Constructor
 Creates a new combined dimension attributes instance. The defaults combine a minimum of three identical dimensions to be shown as the number of items times the length of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CombinedDimensionAttributes()
Public Sub New
See Also
Reference
DimensionSetBaseAttributes.CombinedDimensionAttributes Class
DimensionSetBaseAttributes.CombinedDimensionAttributes Overload
Tekla.Structures.Drawing Namespace